//--------------------------------------------------------------------------------------------------------------------------------
//                  ;;;,
//        ,;;;;;: ,;;;:.,;..
//         :;;"`,;;;;;;"":;;					单元名称：线程处理
//      ..;;:  .;;,.;;:',;;"
//    ,;;;;;;" :;`',;",;;"						编写日期：2004年5月20
//   :" ,;:` , `:.;;;;;'
//    ,;;;,;:;;,;;;, ,;							编写人员：卢明远
//   :;;;"` `:;;;;;,;,.;.
//   '""   .;;`.;";:;;;;` ;,					备注信息：
//       .;"`  ::. '   .,;;;
//      ""     ';;;;;;;;;;`
//--------------------------------------------------------------------------------------------------------------------------------
#ifndef __LmyUnitMLmyUnitHPP__
#define __LmyUnitMLmyUnitHPP__
//--------------------------------------------------------------------------------------------------------------------------------
//公共头文件
#include "mstring.h"
#include "mobject.h"
#include "mdatetime.h"
#include "mmutex.h"
#include "mdll.h"
#include "mthread.h"
#include "mdatastruct.h"
#include "moptiontree.h"
#include "msysteminfo.h"

#include "mfile.h"
#include "minifile.h"
#include "mdbffile.h"
#ifdef WINDOWSCODE
	#include "mexcelfile.h"
#endif //WINDOWSCODE
#include "mlogfile.h"

#include "mcheckcode.h"
#include "mdes.h"

#include "mblockcompress.h"
#include "mlzw.h"

#include "msocket.h"
#include "msrvcomm.h"
//................................................................................................................................
#ifdef WINDOWSCODE
//................................................................................................................................
//Windows操作系统
#ifndef _HAND_SETLMYLIB_
	#ifdef _DEBUG
		#pragma comment(lib,"..\\LmyUnit\\UnitLib\\Debug\\UnitLib.lib")
	#else
		#pragma comment(lib,"..\\LmyUnit\\UnitLib\\Release\\UnitLib.lib")
	#endif //_DEBUG
#endif //_HAND_SETLMYLIB_
//................................................................................................................................
#else
//................................................................................................................................
//Linux操作系统
#include <vector>
#include <map>
#include <string>
#include <new>
#undef new
#define new new(std::nothrow)
//................................................................................................................................
#endif //WINDOWSCODE
//--------------------------------------------------------------------------------------------------------------------------------
#endif //__LmyUnitMLmyUnitHPP__
//--------------------------------------------------------------------------------------------------------------------------------
