//--------------------------------------------------------------------------------------------------------------------------------
//                  ;;;,
//        ,;;;;;: ,;;;:.,;..
//         :;;"`,;;;;;;"":;;					单元名称：系统信息处理
//      ..;;:  .;;,.;;:',;;"
//    ,;;;;;;" :;`',;",;;"						编写日期：2004年5月20
//   :" ,;:` , `:.;;;;;'
//    ,;;;,;:;;,;;;, ,;							编写人员：richtech
//   :;;;"` `:;;;;;,;,.;.
//   '""   .;;`.;";:;;;;` ;,					备注信息：
//       .;"`  ::. '   .,;;;
//      ""     ';;;;;;;;;;`
//--------------------------------------------------------------------------------------------------------------------------------
#ifndef __LmyUnitMSystemInfo__
#define __LmyUnitMSystemInfo__
//--------------------------------------------------------------------------------------------------------------------------------
//公共头文件

#include "mobject.h"
//................................................................................................................................
#ifdef WINDOWSCODE
//................................................................................................................................
//Windows操作系统
#include "mregister.h"
//................................................................................................................................
#else
//................................................................................................................................
//Linux操作系统
#include "mfile.h"
#include "stdlib.h"
//................................................................................................................................
#endif
//--------------------------------------------------------------------------------------------------------------------------------
#pragma pack(1)
//--------------------------------------------------------------------------------------------------------------------------------
typedef struct
{
	char                            Indentify[50];                      //处理器标示
    char                            ProcessName[50];                    //处理器名称
    unsigned long                   Frequency;                          //处理器频率[MHZ]
    char                            Vendor[30];                         //制造商
} tagSystemInfoCpuInfo;
//................................................................................................................................
typedef struct
{
	char							Indentify[30];                      //系统标示
	char							BiosDate[20];						//BIOS更新日期
	char							BiosVersion[30];                    //BIOS版本
	char							VideoDate[20];						//显示BIOS日期
	char							VideoVersion[30];					//显示BIOS版本
} tagSystemInfoBIOSInfo;
//................................................................................................................................
typedef struct
{
	unsigned long					PhyMemorySize;						//物理内存大小[M]
	unsigned long					PhyAvailableSize;					//可用物理内存大小[M]
	unsigned long					VirMemoryUserSize;					//本进程所用的虚拟内存大小
} tagSystemInfoMemoryInfo;
//................................................................................................................................
typedef struct
{
	unsigned char		OSType;				//操作系统类型
											//0x00 Windows9X
											//0x01 Win32
											//0x02 Windosw2000 / WindowsNT
											//0x80 Linux
	char				Description[100];   //系统描述
	unsigned long		CPUCount;			//CPU数量
	unsigned long		CPUFreq;			//CPU平均频率（单位：MHZ）
	unsigned long		CPUPercent;			//CPU利用率
	unsigned long		PhyMemorySize;		//物理内存大小（单位：M）
	unsigned long		PhyMemoryPercent;	//物理内存利用率
} tagHardWareInfo;
//--------------------------------------------------------------------------------------------------------------------------------
#pragma pack()
//--------------------------------------------------------------------------------------------------------------------------------
class MSystemInfo : public MObject
{
protected:
	static char				m_ApplicationPath[256];
public:
	MSystemInfo(void);
	virtual ~MSystemInfo();
public:
	static int  GetCPUInfo(tagSystemInfoCpuInfo * Out,unsigned short InSize);
	static int  GetBIOSInfo(tagSystemInfoBIOSInfo * Out);
	static int  GetMemoryInfo(tagSystemInfoMemoryInfo * Out);
	static int  GetCPUPercent(void);
	static int  GetMemoryPercent(void);
	static int  GetSystemHardWareInfo(tagHardWareInfo * Out);
	static MString GetApplicationFilePath(void);

	DECLARE_LMYUNIT(MSystemInfo)
};
//--------------------------------------------------------------------------------------------------------------------------------
#endif
//--------------------------------------------------------------------------------------------------------------------------------
